Tekla Open API Reference for Tekla Structures 2025
CrossSection.InnerSurfacePoints Property
 Gets the points for inner surfaces.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<List<Point>> InnerSurfacePoints { get; }
Public ReadOnly Property InnerSurfacePoints As List(Of List(Of Point))
	Get
Property Value
Type: List<List<Point>>
See Also
Reference
CrossSection Class
Tekla.Structures.Catalogs Namespace